toasterllc/MDCCode/Code/STM32/STLoader/Source/main.cpp
#include <string.h>
#include <algorithm>
#define TaskARM32
#include "Toastbox/Task.h"
#include "Assert.h"
#include "SystemClock.h"
#include "Toastbox/IntState.h"
#include "STM.h"
#include "USB.h"
#include "QSPI.h"
#include "BufQueue.h"
#include "SystemBase.h"

using namespace STM;

// MARK: - Peripherals
USB _USB;

// QSPI clock divider=5 => run QSPI clock at 21.3 MHz
// QSPI alignment=byte, so we can transfer single bytes at a time
QSPI _QSPI(QSPI::Mode::Single, 5, QSPI::Align::Byte, QSPI::ChipSelect::Controlled);

constexpr auto& _MSP = SystemBase::MSP;

using _ICE_CRST_ = GPIO<GPIOPortI, GPIO_PIN_6>;
using _ICE_CDONE = GPIO<GPIOPortI, GPIO_PIN_7>;
using _ICE_ST_SPI_CLK = GPIO<GPIOPortB, GPIO_PIN_2>;
using _ICE_ST_SPI_CS_ = GPIO<GPIOPortB, GPIO_PIN_6>;

STM::Cmd _Cmd = {};

alignas(4) uint8_t _Buf0[1024]; // Aligned to send via USB
alignas(4) uint8_t _Buf1[1024]; // Aligned to send via USB
BufQueue<2> _Bufs(_Buf0, _Buf1);

// The Startup class needs to exist in the `uninit` section,
// so that its _appEntryPointAddr member doesn't get clobbered
// on startup.
using _VoidFn = void(*)();
static volatile _VoidFn _AppEntryPoint [[noreturn, gnu::section(".uninit")]] = 0;

static constexpr uint32_t _UsPerTick  = 1000;

class _CmdRecvTask;
class _CmdHandleTask;
class _USBDataOutTask;
class _USBDataInTask;

#define _Subtasks       \
    _CmdHandleTask,     \
    _USBDataOutTask,    \
    _USBDataInTask

using _Scheduler = Toastbox::Scheduler<
    _UsPerTick, // T_UsPerTick
    
    #warning TODO: remove stack guards for production
    _StackMain, // T_MainStack
    4,          // T_StackGuardSize
    
    // Tasks
    _CmdRecvTask,
    _Subtasks
>;






















template <typename... T_Tasks>
static void _ResetTasks() {
    (_Scheduler::Stop<T_Tasks>(), ...);
}

static size_t _USBCeilToMaxPacketSize(size_t len) {
    // Round `len` up to the nearest packet size, since the USB hardware limits
    // the data received based on packets instead of bytes
    const size_t rem = len%USB::MaxPacketSizeIn();
    len += (rem>0 ? USB::MaxPacketSizeIn()-rem : 0);
    return len;
}

// _USBDataOutTask: reads `len` bytes from the DataOut endpoint and writes them to _Bufs
class _USBDataOutTask {
public:
    static void Start(size_t len) {
        // Make sure this task isn't busy
        Assert(!_Scheduler::Running<_USBDataOutTask>());
        
        _Len = len;
        _Scheduler::Start<_USBDataOutTask>([] {
            while (_Len) {
                _Scheduler::Wait([] { return !_Bufs.full(); });
                
                // Prepare to receive either `_Len` bytes or the
                // buffer capacity bytes, whichever is smaller.
                const size_t cap = _USBCeilToMaxPacketSize(std::min(_Len, _Bufs.back().cap));
                // Ensure that after rounding up to the nearest packet size, we don't
                // exceed the buffer capacity. (This should always be safe as long as
                // the buffer capacity is a multiple of the max packet size.)
                Assert(cap <= _Bufs.back().cap);
                _USB.recv(Endpoints::DataOut, _Bufs.back().data, cap);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
                
                // Never claim that we read more than the requested data, even if ceiling
                // to the max packet size caused us to read more than requested.
                const size_t recvLen = std::min(_Len, _USB.recvLen(Endpoints::DataOut));
                _Len -= recvLen;
                _Bufs.back().len = recvLen;
                _Bufs.push();
            }
        });
    }
    
    // Task options
    using Options = Toastbox::TaskOptions<>;
    
    // Task stack
    [[gnu::section(".stack._USBDataOutTask")]]
    static inline uint8_t Stack[256];
    
private:
    static inline size_t _Len = 0;
};

// _USBDataInTask: writes buffers from _Bufs to the DataIn endpoint, and pops them from _Bufs
class _USBDataInTask {
public:
    static void Start() {
        _Scheduler::Start<_USBDataInTask>([] {
            for (;;) {
                _Scheduler::Wait([] { return !_Bufs.empty(); });
                
                // Send the data and wait until the transfer is complete
                auto& buf = _Bufs.front();
                _USB.send(Endpoints::DataIn, buf.data, buf.len);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
                
                buf.len = 0;
                _Bufs.pop();
            }
        });
    }
    
    // Task options
    using Options = Toastbox::TaskOptions<>;
    
    // Task stack
    [[gnu::section(".stack._USBDataInTask")]]
    static inline uint8_t Stack[256];
};







static void _USBSendStatus(bool s) {
    alignas(4) static bool status = false; // Aligned to send via USB
    status = s;
    _USB.send(Endpoints::DataIn, &status, sizeof(status));
}

static void _StatusGet() {
    // Send status
    _USBSendStatus(true);
    // Wait for host to receive status
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Send status struct
    alignas(4) static const STM::Status status = { // Aligned to send via USB
        .magic      = STM::Status::MagicNumber,
        .version    = STM::Version,
        .mode       = STM::Status::Modes::STMLoader,
    };
    
    _USB.send(Endpoints::DataIn, &status, sizeof(status));
}

static void _BootloaderInvoke() {
    // Send status
    _USBSendStatus(true);
    // Wait for host to receive status before resetting
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Perform software reset
    HAL_NVIC_SystemReset();
    // Unreachable
    abort();
}

static void _LEDSet() {
    switch (_Cmd.arg.LEDSet.idx) {
    case 0: _USBSendStatus(false); return;
    case 1: SystemBase::LED1::Write(_Cmd.arg.LEDSet.on); break;
    case 2: SystemBase::LED2::Write(_Cmd.arg.LEDSet.on); break;
    case 3: SystemBase::LED3::Write(_Cmd.arg.LEDSet.on); break;
    }
    
