toasterllc/MDCCode/Code/STM32/STLoader/Source/main.cpp
    while (len) {
        _Scheduler::Wait([] { return !_Bufs.empty(); });
        
        // Write the data over Spy-bi-wire
        auto& buf = _Bufs.front();
        _MSP.write(addr, buf.data, buf.len);
        // Update the MSP430 address to write to
        addr += buf.len;
        len -= buf.len;
        // Pop the buffer, which we just finished sending over Spy-bi-wire
        _Bufs.pop();
    }
    
    // Verify the CRC of all the data we wrote
    const auto r = _MSP.crcVerify();
    // Send status
    _USBSendStatus(r == _MSP.Status::OK);
}

struct _MSPDebugState {
    uint8_t bits = 0;
    uint8_t bitsLen = 0;
    size_t len = 0;
    bool ok = true;
};

static void _MSPDebugPushReadBits(_MSPDebugState& state) {
    if (state.len >= sizeof(_Buf1)) {
        state.ok = false;
        return;
    }
    
    // Enqueue the new byte into `_Buf1`
    _Buf1[state.len] = state.bits;
    state.len++;
    // Reset our bits
    state.bits = 0;
    state.bitsLen = 0;
}

static void _MSPDebugHandleSBWIO(const MSPDebugCmd& cmd, _MSPDebugState& state) {
    const bool tdo = _MSP.debugSBWIO(cmd.tmsGet(), cmd.tclkGet(), cmd.tdiGet());
    if (cmd.tdoReadGet()) {
        // Enqueue a new bit
        state.bits <<= 1;
        state.bits |= tdo;
        state.bitsLen++;
        
        // Enqueue the byte if it's filled
        if (state.bitsLen == 8) {
            _MSPDebugPushReadBits(state);
        }
    }
}

static void _MSPDebugHandleCmd(const MSPDebugCmd& cmd, _MSPDebugState& state) {
    switch (cmd.opGet()) {
    case MSPDebugCmd::Ops::TestSet:     _MSP.debugTestSet(cmd.pinValGet()); break;
    case MSPDebugCmd::Ops::RstSet:      _MSP.debugRstSet(cmd.pinValGet()); 	break;
    case MSPDebugCmd::Ops::TestPulse:   _MSP.debugTestPulse(); 				break;
    case MSPDebugCmd::Ops::SBWIO:       _MSPDebugHandleSBWIO(cmd, state);	break;
    default:                            abort();
    }
}

static void _MSPDebug() {
    auto& arg = _Cmd.arg.MSPDebug;
    
    // Bail if more data was requested than the size of our buffer
    if (arg.respLen > sizeof(_Buf1)) {
        // Send preliminary status: error
        _USBSendStatus(false);
        return;
    }
    
    // Send preliminary status: OK
    _USBSendStatus(true);
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    _MSPDebugState state;
    
    // Handle debug commands
    {
        while (arg.cmdsLen) {
            // Receive debug commands into _Buf0
            _USB.recv(Endpoints::DataOut, _Buf0, sizeof(_Buf0));
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
            
            // Handle each MSPDebugCmd
            const MSPDebugCmd* cmds = (MSPDebugCmd*)_Buf0;
            const size_t cmdsLen = _USB.recvLen(Endpoints::DataOut) / sizeof(MSPDebugCmd);
            for (size_t i=0; i<cmdsLen && state.ok; i++) {
                _MSPDebugHandleCmd(cmds[i], state);
            }
            
            arg.cmdsLen -= cmdsLen;
        }
    }
    
    // Reply with data generated from debug commands
    {
        // Push outstanding bits into the buffer
        // This is necessary for when the client reads a number of bits
        // that didn't fall on a byte boundary.
        if (state.bitsLen) _MSPDebugPushReadBits(state);
        
        if (arg.respLen) {
            // Send the data and wait for it to be received
            _USB.send(Endpoints::DataIn, _Buf1, arg.respLen);
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
        }
    }
    
    // Send status
    _USBSendStatus(state.ok);
}

class _CmdHandleTask {
public:
    static void CmdHandle() {
        _Scheduler::Start<_CmdHandleTask>([] { _CmdHandle(); });
    }
    
    // Task options
    using Options = Toastbox::TaskOptions<>;
    
    // Task stack
    [[gnu::section(".stack._CmdHandleTask")]]
    static inline uint8_t Stack[512];
    
private:
    static void _CmdHandle() {
        switch (_Cmd.op) {
        // Common Commands
        case Op::EndpointsFlush:        _EndpointsFlush();              break;
        case Op::StatusGet:             _StatusGet();                   break;
        case Op::BootloaderInvoke:      _BootloaderInvoke();            break;
        case Op::LEDSet:                _LEDSet();                      break;
        // STM32 Bootloader
        case Op::STMWrite:              _STMWrite();                    break;
        case Op::STMReset:              _STMReset();                    break;
        // ICE40 Bootloader
        case Op::ICEWrite:              _ICEWrite();                    break;
        // MSP430 Bootloader
        case Op::MSPConnect:            _MSPConnect();                  break;
        case Op::MSPDisconnect:         _MSPDisconnect();               break;
        // MSP430 Debug
        case Op::MSPRead:               _MSPRead();                     break;
        case Op::MSPWrite:              _MSPWrite();                    break;
        case Op::MSPDebug:              _MSPDebug();                    break;
        // Bad command
        default:                        _USBSendStatus(false);          break;
        }
    }
};

struct _CmdRecvTask {
    static void Run() {
        for (;;) {
            // Wait for USB to be re-connected (`Connecting` state) so we can call _USB.connect(),
            // or for a new command to arrive so we can handle it.
            _Scheduler::Wait([&] { return _USB.state()==USB::State::Connecting || _USB.cmdRecv(); });
            
            #warning TODO: do we still need to disable interrupts?
            // Disable interrupts so we can inspect+modify _usb atomically
            Toastbox::IntState ints(false);
            
            // Reset all tasks
            // This needs to happen before we call `_USB.connect()` so that any tasks that
            // were running in the previous USB session are stopped before we enable
            // USB again by calling _USB.connect().
            _ResetTasks<_Subtasks>();
            
            switch (_USB.state()) {
            case USB::State::Connecting:
                _USB.connect();
                continue;
            case USB::State::Connected:
                if (!_USB.cmdRecv()) continue;
                break;
            default:
                continue;
            }
            
